var quotes = [
  {
    caption:
      " أكثر ما يُخيفني هو أنا ، أخاف ألا أعرف ماذا سأفعل ، أخاف مما أفعله الآن. ",
    auther: "هاروكي موراكامي",
  },
  {
    caption:
      " كافكا, في حياة كل شخص نقطة لاعودة وفي حالات نادرة توجد نقطة يمكنه التقدم منها, وحين تصل لتلك النقطة و كل ماعلينا فعله أن نتقبل الحقيقة بهدوء , وهكذا نظل أحياء .. ",
    auther: "هاروكي موراكامي",
  },
   {
    caption:
      "ولعل ما تخشاه ليس بكائن .. ولعل ما ترجوه سوف يكون .. ولعل ما هونت ليس بهين .. ولعل ما شدّدت سوف يهون ",
    auther: "ابو العتاهية",
  },
  {
    caption:
      "انا لست احسب بين فرسان الزمان ان عد فرسان الزمان, لكن قلبي كان دوما قلب فارس كره المنافق والجبان مقدار ما عشق الحقيقة",
    auther: "نجيب سرور",
  },
  {
    caption:
      "دع الأيام تفعل ما تشاء وطب نفساً إذا حكم القضاء ولا تجزع لحادثة الليالي، فما لحوادث الدنيا بقاء وكن رجلا على الأهوال جلدا وشيمتك السماحة والوفاء، تستر بالسخاء فكل عيب، يغطيه كما قيل السخاء ولا ترج السماحة من بخيل، فما في النار للظمآن ماء.",
    auther: "الإمام الشافعي",
  },
  {
    caption:
      " انا لتعجزنا الحياة  فنلومها .. لا عجزنا  ونروح نندب حظنا ,و نقول هذا العصر لم يخلق لنا هو عصرنا  لكننا لسنا به الفرسان نحن قطيع عميان يفتش فى الفراغ عن البطولة والأرض بالأبطال ملأى حولنا ! ملأى .. ولكن باللصوص ",
    auther: "نجيب سرور",
  },
  {
    caption:
      "! الخوف قواد .. فحاذر أن تخاف قل ما تريد لمن تريد كما تريد متى تريد لو بعدها الطوفان قلها فى الوجوه بلا وجل",
    auther: "نجيب سرور",
  },
  {
    caption: " اترى حين أفقأ عينيك ثم أثبت جوهرتين مكانهما هل ترى! هي أشياءَ لا تُشترى",
    auther: "امل دنقل ـ لا تصالح",
  },
  {
    caption:
      " لا تصالح علي الدم .. حتي بدم لا تصالح! و لو قيل رأس برأس أكل الرؤوس سواء؟ أقلب الغريب كقلب أخيك؟  أعيناه عينا أخيك؟ و هل  تتساوي يد ... سيفها كان لك بيد سيفها أثكلك",
    auther: "امل دنقل ـ لا تصالح",
  },
  {
    caption:
      "ما اقسى الجدار عندما ينهض فى وجه الشروق ربما ننفق كل العمر كى ننقب ثغره ليمر النور للأجيال .. مره.. ربما لو لم يكن هذا الجدار ما عرفنا قيمة الضوء الطليق ",
    auther: "امل دنقل-البكاء بين يدي زرقاء اليمامة",
  },
  {
    caption:
      "قلت لكم مرارا إن الطوابير التي تمر في استعراض عيد الفطر والجلاء لا تصنع انتصارا إن المدافع التي تصطف على الحدود في الصحارى لا تطلق النيران إلا حين تستدير للوراء إن الرصاصة التي ندفع فيها ثمن الكسرة والدواء لا تقتل الأعداء لكنها تقتلنا إذا رفعنا صوتنا جهارا تقتلنا، وتقتل الصغار",
    auther: "― أمل دنقل , تعليق على ما حدث",
  },
  {
    caption:
      "نفسي فداء للرجال ملثمين إذ يطلقون سلاحهم مثل الدعاء يطير من أدنى لأعلى مثل تاريخ هنا يملي فيتلى حاصرونا كيفما شئتم فإن الخبز والتاريخ يصنع هاهنا تحت الحصار ",   auther: "― أمل دنقل , تعليق على ما حدث",
  auther: " تميم البرغوثي " 
  },
  {
    caption:
      "في القدس رغم تتابع النكبات ريح براءة في الجو ريح طفولة فترى الحمام يطير يعلن دولة في الريح بين رصاصتين",
    auther: " تميم البرغوثي " 
  },
  {
    caption:" مَنْ كان ذا حلمٍ و طالَ بهِ المَدى، فليحمِهِ و ليحمِ أيضاً نفسَهُ مِن حلمِه فالحلمُ يكبرُ أدهرا في يومِه, و يزيدُ دينُ الدهرِ حتى يستَحيل, فترى ابن آدم راضياً منْ أي شيءٍ بالقليل لا تقبلو بالقبح يا اهلي مكافئة على الصبر الجميل"
     , auther: "تميم البرغوثي",
  },
  
  {
    caption:
    "في فخ غريب وقعنا في عالم الأرقام ضعنا, كيف الخروج ..كيف الخروج من اين الطريق؟"
     , auther: 
     "ابطال الديجيتال",
  },
  {
    caption:
"عندما ينشأ فراغ فلا بد أن يأتي شيء ما ليملأه" 
    , auther:
    "هاروكي موراكامي",
  },  
  {
    caption:
"الإختلافات الحقيقية بين الناس والمجتمعات والأنظمة السياسية ليست في الغايات،وإنما في الوسائل. ولذلك لاتسألوا كثيرا عن الغايات،لأن الغايات المعلنة ستكون دوما رفيعة وحسنة،اسألو عن الوسائل،أو تأملوا بها ، فهذا لايخدع أبداً "
     , auther:
      "علي عزت بيجوفيتش",
  },
  {
    caption:
"يجب ان تنظر , وهذه قاعدة اخرى من قواعدنا , ان اغماض العينين لن يغير شيئ, لا شيئ سيختفي لمجرد انك لا تريد ان تراه , بل ستجد ان الامر ازداد سوءا في المرة القادمة التي تنظر فيها , هذا هو العالم الذي نعيش فيه ابق عيناك مفتوحتان على وسعهما , الجبان فقط هو من يغمض عينيه"
     , auther:
      "هاروكي موراكامي"
  },
   { caption: "و خيال ابيه فى الاحلام يوقض فى القلب الحساس حب الخير لكل الناس مهما كان الثمن من الصعاب سيظل البطل القناص  بكل الصبر و الاخلاص" ,auther :"رشا رزق"}
,
   { caption: "سأظل أناضل لاسترجاع الوطن لانه حقي وماضيّ ومستقبلي الوحيد… لأن لي فيه شجرة وغيمة وظل وشمس تتوقد وغيوم تمطر الخصب… وجذور تستعصي على القلع" ,auther :"غسان كنفاني"}
  ,
   { caption: "هذا العالم يسحق العدل بحقارة كل يوم!" ,auther :"غسان كنفاني"}
,
   { caption: "!لك شيء في هذا العالم.. فقم" ,auther :"غسان كنفاني"}
,
   { caption: "إن الفكــرة النبيــلة غالبــاً لا تحتــاج للفهم... بــل تحتــاج للإحــســاس" ,auther :"غسان كنفاني"}
,
   { caption: "يسرقون رغيفك .. ثم يعطونك منه كِسرة .. ثم يأمرونك أن تشكرهم على كرمهم .. يالوقاحتهم !!" ,auther :"غسان كنفاني"}
,
   { caption: "لقد أخطأنا حين اعتبرنا أن الوطن هو الماضي فقط .. أما خالد فالوطن عنده هو المستقبل" ,auther :"غسان كنفاني"}

  
  
];
let used = [];

function change() {
  var max = quotes.length - 1;

  if (used.length == quotes.length) {
    used = [];
  }
  do {
    var r = Math.floor(Math.random() * quotes.length);
  } while (used.includes(r));

  document.getElementById("caption").innerHTML =
    '<i class="fa-solid fa-quote-left"></i>' +
    " " +
    " " +
    quotes[r].caption +
    " " +
    " " +
    '<i class="fa-solid fa-quote-right"></i>' ;

  document.getElementById("auther").innerHTML = quotes[r].auther;
  console.log(r);
  used.push(r);
  console.log(used);
}
